{"format": "graph-model", "generatedBy": "1.14.0", "convertedBy": "TensorFlow.js Converter v1.2.6", "modelTopology": {"node": [{"name": "sub_2", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "1"}, {"size": "-1"}, {"size": "-1"}, {"size": "3"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/offset_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "34"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/offset_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "34"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "384"}]}}}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "384"}]}}}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/depthwise_weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "384"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "384"}]}}}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "192"}, {"size": "192"}]}}}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "192"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "192"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "96"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "96"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "48"}, {"size": "96"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "48"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "24"}, {"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/depthwise_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/depthwise_weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "24"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_0/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_0/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}, {"size": "3"}, {"size": "3"}, {"size": "24"}]}}}}}, {"name": "MobilenetV1/segment_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/segment_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "clip_by_value/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "clip_by_value/Minimum/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/part_offset_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "48"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/part_offset_2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "48"}]}}}}}, {"name": "MobilenetV1/part_heatmap_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/part_heatmap_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "24"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/embedding_2/Conv2D_bias", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "34"}]}}}}}, {"name": "MobilenetV1/embedding_2/weights", "op": "Const", "attr": {"dtype": {"type": "DT_FLOAT"}, "value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "34"}]}}}}}, {"name": "MobilenetV1/heatmap_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/heatmap_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "17"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/displacement_fwd_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/displacement_fwd_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/displacement_bwd_2/Conv2D_bias", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/displacement_bwd_2/weights", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "384"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["sub_2", "MobilenetV1/Conv2d_0/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_0/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_0/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_0/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_0/Relu6", "MobilenetV1/Conv2d_1_depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_1_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_1_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_1_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_1_depthwise/Relu6", "MobilenetV1/Conv2d_1_pointwise/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_1_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_1_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_1_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_1_pointwise/Relu6", "MobilenetV1/Conv2d_2_depthwise/depthwise_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_2_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_2_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_2_depthwise/Relu6", "MobilenetV1/Conv2d_2_pointwise/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_2_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_2_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_2_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_2_pointwise/Relu6", "MobilenetV1/Conv2d_3_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_3_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_3_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_3_depthwise/Relu6", "MobilenetV1/Conv2d_3_pointwise/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_3_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_3_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_3_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_3_pointwise/Relu6", "MobilenetV1/Conv2d_4_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "2", "2", "1"]}}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_4_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_4_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_4_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_4_depthwise/Relu6", "MobilenetV1/Conv2d_4_pointwise/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_4_pointwise/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_4_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_4_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_4_pointwise/Relu6", "MobilenetV1/Conv2d_5_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_5_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_5_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_5_depthwise/Relu6", "MobilenetV1/Conv2d_5_pointwise/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_5_pointwise/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_5_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_5_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_5_pointwise/Relu6", "MobilenetV1/Conv2d_6_depthwise/depthwise_weights"], "attr": {"strides": {"list": {"i": ["1", "2", "2", "1"]}}, "data_format": {"s": "TkhXQw=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_6_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_6_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_6_depthwise/Relu6", "MobilenetV1/Conv2d_6_pointwise/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_6_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_6_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_6_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_6_pointwise/Relu6", "MobilenetV1/Conv2d_7_depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_7_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_7_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_7_depthwise/Relu6", "MobilenetV1/Conv2d_7_pointwise/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_7_pointwise/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_7_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_7_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_7_pointwise/Relu6", "MobilenetV1/Conv2d_8_depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_8_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_8_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_8_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_8_depthwise/Relu6", "MobilenetV1/Conv2d_8_pointwise/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_8_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_8_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_8_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_8_pointwise/Relu6", "MobilenetV1/Conv2d_9_depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_9_depthwise/depthwise_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_9_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_9_depthwise/Relu6", "MobilenetV1/Conv2d_9_pointwise/weights"], "attr": {"T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_9_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_9_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_9_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_9_pointwise/Relu6", "MobilenetV1/Conv2d_10_depthwise/depthwise_weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_10_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_10_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_10_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_10_depthwise/Relu6", "MobilenetV1/Conv2d_10_pointwise/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_10_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_10_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_10_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_10_pointwise/Relu6", "MobilenetV1/Conv2d_11_depthwise/depthwise_weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_11_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_11_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_11_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_11_depthwise/Relu6", "MobilenetV1/Conv2d_11_pointwise/weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_11_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_11_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_11_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_11_pointwise/Relu6", "MobilenetV1/Conv2d_12_depthwise/depthwise_weights"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_12_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_12_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_12_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_12_depthwise/Relu6", "MobilenetV1/Conv2d_12_pointwise/weights"], "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_12_pointwise/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_12_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_12_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv", "op": "DepthwiseConv2dNative", "input": ["MobilenetV1/Conv2d_12_pointwise/Relu6", "MobilenetV1/Conv2d_13_depthwise/depthwise_weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "padding": {"s": "U0FNRQ=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_13_depthwise/depthwise_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/Conv2d_13_depthwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_13_depthwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_depthwise/Relu6", "MobilenetV1/Conv2d_13_pointwise/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1", "op": "BiasAdd", "input": ["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1/conv", "MobilenetV1/Conv2d_13_pointwise/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/Conv2d_13_pointwise/Relu6", "op": "Relu6", "input": ["MobilenetV1/Conv2d_13_pointwise/BatchNorm/batchnorm_1/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "float_short_offsets/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/offset_2/weights"], "attr": {"strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "float_segments/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/segment_2/weights"], "attr": {"dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}}}, {"name": "add_1/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/part_offset_2/weights"], "attr": {"explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "float_part_heatmaps/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/part_heatmap_2/weights"], "attr": {"use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "float_long_offsets/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/embedding_2/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "float_heatmaps/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/heatmap_2/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "data_format": {"s": "TkhXQw=="}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}}}, {"name": "MobilenetV1/displacement_fwd_2/BiasAdd/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/displacement_fwd_2/weights"], "attr": {"data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "explicit_paddings": {"list": {}}, "use_cudnn_on_gpu": {"b": true}, "padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}}}, {"name": "MobilenetV1/displacement_bwd_2/BiasAdd/conv", "op": "Conv2D", "input": ["MobilenetV1/Conv2d_13_pointwise/Relu6", "MobilenetV1/displacement_bwd_2/weights"], "attr": {"padding": {"s": "U0FNRQ=="}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "explicit_paddings": {"list": {}}}}, {"name": "float_short_offsets", "op": "BiasAdd", "input": ["float_short_offsets/conv", "MobilenetV1/offset_2/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "float_segments", "op": "BiasAdd", "input": ["float_segments/conv", "MobilenetV1/segment_2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "add_1", "op": "BiasAdd", "input": ["add_1/conv", "MobilenetV1/part_offset_2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "float_part_heatmaps", "op": "BiasAdd", "input": ["float_part_heatmaps/conv", "MobilenetV1/part_heatmap_2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "float_long_offsets", "op": "BiasAdd", "input": ["float_long_offsets/conv", "MobilenetV1/embedding_2/Conv2D_bias"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "float_heatmaps", "op": "BiasAdd", "input": ["float_heatmaps/conv", "MobilenetV1/heatmap_2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/displacement_fwd_2/BiasAdd", "op": "BiasAdd", "input": ["MobilenetV1/displacement_fwd_2/BiasAdd/conv", "MobilenetV1/displacement_fwd_2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "MobilenetV1/displacement_bwd_2/BiasAdd", "op": "BiasAdd", "input": ["MobilenetV1/displacement_bwd_2/BiasAdd/conv", "MobilenetV1/displacement_bwd_2/Conv2D_bias"], "attr": {"T": {"type": "DT_FLOAT"}, "data_format": {"s": "TkhXQw=="}}}, {"name": "clip_by_value/Minimum", "op": "Minimum", "input": ["add_1", "clip_by_value/Minimum/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "float_part_offsets", "op": "Maximum", "input": ["clip_by_value/Minimum", "clip_by_value/y"], "attr": {"T": {"type": "DT_FLOAT"}}}], "library": {}, "versions": {"producer": 38}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "MobilenetV1/offset_2/Conv2D_bias", "shape": [34], "dtype": "float32", "quantization": {"min": -0.08792929969136244, "scale": 2.122050866187915e-06, "dtype": "uint16"}}, {"name": "MobilenetV1/offset_2/weights", "shape": [1, 1, 384, 34], "dtype": "float32", "quantization": {"min": -0.8012001821994236, "scale": 2.4171851270120786e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_13_pointwise/Conv2D_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -3.3090264518646406, "scale": 0.00011599223401095907, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_13_pointwise/weights", "shape": [1, 1, 384, 384], "dtype": "float32", "quantization": {"min": -1.3656869902166575, "scale": 4.2503718845247815e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -2.021474768930454, "scale": 6.314740625173228e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_13_depthwise/depthwise_weights", "shape": [3, 3, 384, 1], "dtype": "float32", "quantization": {"min": -2.2761803466140282, "scale": 8.442492291139157e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_12_pointwise/Conv2D_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -1.0674666925108551, "scale": 3.317999168565383e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_12_pointwise/weights", "shape": [1, 1, 384, 384], "dtype": "float32", "quantization": {"min": -0.5572230073564739, "scale": 1.703941677440138e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -6.0177228460052135, "scale": 0.0001553883039224627, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_12_depthwise/depthwise_weights", "shape": [3, 3, 384, 1], "dtype": "float32", "quantization": {"min": -2.239977986568661, "scale": 7.851307348645851e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_11_pointwise/Conv2D_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -10.24955907384218, "scale": 0.0002587553728469915, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_11_pointwise/weights", "shape": [1, 1, 384, 384], "dtype": "float32", "quantization": {"min": -1.3085542446289855, "scale": 3.8843334262318495e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -6.3592472289459305, "scale": 0.00022323330743658268, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_11_depthwise/depthwise_weights", "shape": [3, 3, 384, 1], "dtype": "float32", "quantization": {"min": -3.2175203089584175, "scale": 9.50607235193198e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_10_pointwise/Conv2D_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -7.7282513225634295, "scale": 0.0002081067245412384, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_10_pointwise/weights", "shape": [1, 1, 384, 384], "dtype": "float32", "quantization": {"min": -0.8857060482311533, "scale": 2.7586932293999667e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -21.617181046185326, "scale": 0.0004354439820760883, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_10_depthwise/depthwise_weights", "shape": [3, 3, 384, 1], "dtype": "float32", "quantization": {"min": -3.058203296347778, "scale": 8.500439993183918e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_9_pointwise/Conv2D_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -9.532602104500755, "scale": 0.00021809742162763696, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_9_pointwise/weights", "shape": [1, 1, 384, 384], "dtype": "float32", "quantization": {"min": -1.2318892582626848, "scale": 4.187820431950928e-05, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -9.755448520579199, "scale": 0.00031122821887316, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_9_depthwise/depthwise_weights", "shape": [3, 3, 384, 1], "dtype": "float32", "quantization": {"min": -3.5617484403764337, "scale": 0.00010704298973301779, "dtype": "uint16"}}, {"name": "MobilenetV1/Conv2d_8_pointwise/Conv2D_bias", "shape": [384], "dtype": "float32", "quantization": {"min": -5.5248427009058645, "scale": 